Revit 2024 API
LabelUtils.GetLabelForSpec Method
 Gets the user-visible name for a spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static string GetLabelForSpec(
	ForgeTypeId specTypeId
)
Visual Basic
Public Shared Function GetLabelForSpec ( _
	specTypeId As ForgeTypeId _
) As String
Visual C++
public:
static String^ GetLabelForSpec(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the spec to get the user-visible name.
Remarks
 The name is obtained in the current Revit language. If the given identifier is a category, this method returns the name of the Family Type spec with that category, e.g. "Family Type: Walls".
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given identifier is neither a spec nor a category.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace